## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/8f81bb299c626875daafdc7ee0c3f2134d5c168b" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/8f81bb299c626875daafdc7ee0c3f2134d5c168b" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZisxS3pFNkZTckF3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTFPVGt5TmpFd01UZ3pOemN6TWprM016UXlNQ0FYRFRJeU1Ea3hPREUzTWpneU5Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EVTVPVEkyTVRBeE9ETTNOek15T1Rjek5ESXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ1pxZVFMZ3VLQkQwUmI2L3FMZE9vWDJuME4Kci90MXliV3cvUXdUWkEyYWNqSVQ5NXpPVENFMEtzdU1oaCtlMERPWEs2RTFmYVg1R2VKc1k4VU5md0RRc2ZORAp2SmxDUUpPaE9LMW5qOFdGb1Q0aVo4SkxRMEJpUUZLRFM4elNTOTlnekJ6T0FZaW9Qb1NzT3A4T2JmUXB6U0o3CjYyS05KK2NBQ3JPcFpRNFV2elZxZlFZMzBpQjVabjZXOGJPcGFTWE1iaGNiTHIwVVBqMnBvWnAwVDBMR2czOTcKOVVFVzhzVURuMTE4KzJ1TWhPKy96amZkVFE5Z3RaU0lScXIzZ2lsbkM3cXNVNjhwUHh6RkFzWldWNnZxaExCZQpUZEloUmloRS9Kc3JsUXkyUUVSRGJQYmR4UjJhOWdtaXB2ZDR5N1kwWWJ2ZTFuTE9uYXI5NGdTYzEzWWxBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQkhEaisxOFRObGUrTWQyMnUwajJheQpPbTlIaDUzMGd5bjgxZkprRlNVUVlCaW03OXRaemUyTHBQZUE1MEVDTHh6L3FYcXZYMy83Z3lrT2xmV2VudnBoCklVdnlDZGJESXkxdDBDUXEzZHhNU2xuQ1YvRlBITHBjZFFIbkxpaUNrakVnck1jK29rRWQyRkJNZDJwUmNnNFIKVFptaXJMNHVYcm1BdHpFc1pETjFSeVUwRkZBSDVMR1R4RWJFTSs4UWNLKzBmUDFTeG1heWVMYVgwV3U3a1cwaApERGhuYmU5NEhoY0Z4c1RVVGNDNUVnUkpyanFJNGZwQi9qOFJ4ZUx2UmY0bE91Nkd2d1F6SHFjVjZvK0laWlJOCnRqQ3dPSkc2am9ieFhPbHlnV2ZReGdPdnBMQ2VQWU4wODgxRTZvMFlzTm9SbHo2L29UWDl2YVAzQlgrZ05nZkkKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T17:28:24Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
!       remove_default_node_pool    = false -> true
        # (26 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
